---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.SuperComponent
zh: 族实例
source: html/1dcf3123-c2ea-867a-7b9a-73173343121e.htm
---
# Autodesk.Revit.DB.FamilyInstance.SuperComponent Property

**中文**: 族实例

Property to get the super component of current family instance.

## Syntax (C#)
```csharp
public Element SuperComponent { get; }
```

## Remarks
When the FamilyInstance has no super component, it returns Nothing nullptr a null reference ( Nothing in Visual Basic)